package mybot;

public class HelpService {

    public String getHelpMessage() {
        return "Список доступных команд, которые ты можешь использовать:\n\n" +
                "1 " + "/about - Что за бот?\n" +
                 "2 " + "/start_learn_theory - Начать изучение теории по JavaScript.\n" +
                 "3 " + "/start_tests - Пройти тесты для проверки своих знаний.\n" +
                 "4 " + "/training_mode - Включить тренировочный режим для практики.\n" +
                 "5 " + "/view_progress - Просмотреть свой прогресс и достижения.\n" +
                 "6 " + "/achievements - Посмотреть свои достижения.\n" +
                 "7 " + "/daily_task - Получить ежедневное задание для практики.\n" +
                 "8 " + "/ask_question - Задать вопрос по теории или JavaScript, и я постараюсь ответить.\n\n" +
                 "Используй эти команды, чтобы изучать JavaScript и проверять свои знания! Если тебе нужна помощь по конкретной команде, просто напиши её название, и я помогу.";
    }
}
